Revit 2024 API
LineProperties.LineWidth Property
 The current width (thickness) of the pen stroke when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double LineWidth { get; }
Visual Basic
Public ReadOnly Property LineWidth As Double
	Get
Visual C++
public:
property double LineWidth {
	double get ();
}
See Also
LineProperties Class
Autodesk.Revit.DB Namespace